target_dic ={
  "text": "1、左乳外上象限巨大低回声团,考虑BI-RADS:5类。2、右乳内上象限，BI-RADS2类。3、双侧腋下未见明显肿大淋巴结。",
  "output_dict": {
    "内乳": {
      "内乳_侧别": None,
      "内乳_淋巴结表现": None,
      "内乳_评估分类": None
    },
    "增生腺体": {
      "增生_侧别": None,
      "增生_表现": None
    },
    "导管": {
      "导管_侧别": None,
      "导管_表现": None
    },
    "病灶": {
      "主体": {"value": "乳","idx": [3,4],"type":"病灶"},
      "病灶_侧别": {"value": "左","idx": [2,3],"type":"侧别"},
      "病灶_回声强度": None,
      "病灶_评估分类": {"value": "BI-RADS:5类","idx":[17,27],"type":"BI-RADS分类_超声"},
      "病灶_象限": {"value": "外上象限","idx":[4,8],"type":"象限定位"},
      "病灶_钟面": None
    },
    "病灶2": {
      "主体": {"value": "乳","idx": [31,32],"type":"病灶"},
      "病灶_侧别": {"value": "右","idx": [30,31],"type":"侧别"},
      "病灶_回声强度": None,
      "病灶_评估分类": {"value": "BI-RADS2类","idx": [37,46],"type":"BI-RADS分类_超声"},
      "病灶_象限": {"value": "内上象限","idx":[32,36],"type":"象限定位"},
      "病灶_钟面": None
    },
    "腋窝": {
      "主体": {"value": "腋下","idx": [51,53],"type":"腋窝"},
      "腋窝_侧别": {"value": "双侧","idx": [49,51],"type":"病灶"},
      "腋窝_淋巴结表现": {"value": "未见明显肿大淋巴结","idx": [53,62],"type":"病灶"},
      "腋窝_评估分类": None
    },
    "锁骨上侧": {
      "锁骨上_淋巴结表现": None,
      "锁骨上_评估分类": None,
      "锁骨上侧_侧别": None
    },
    "锁骨下侧": {
      "锁骨下_侧别": None,
      "锁骨下_淋巴结表现": None,
      "锁骨下_评估分类": None
    }
  }
}


dic1 = {"text":"1、左乳外上象限巨大低回声团,考虑BI-RADS:5类。2、右乳内上象限，BI-RADS2类。3、双侧腋下未见明显肿大淋巴结。",
    "output_dict": {
            "内乳": {
                "内乳_侧别": None,
                "内乳_淋巴结表现": None,
                "内乳_评估分类": None
            },
            "增生腺体": {
                "增生_侧别": None,
                "增生_表现": None
            },
            "导管": {
                "导管_侧别": None,
                "导管_表现": None
            },
            "病灶": {
                "病灶_侧别": "左",
                "病灶_回声强度": None,
                "病灶_评估分类": "BI-RADS:5类",
                "病灶_象限": "外上象限",
                "病灶_钟面": None
            },
            "病灶2": {
                "病灶_侧别": "右",
                "病灶_回声强度": None,
                "病灶_评估分类": "BI-RADS2类",
                "病灶_象限": "内上象限",
                "病灶_钟面": None
            },
            "腋窝": {
                "腋窝_侧别": "双侧",
                "腋窝_淋巴结表现": "未见明显肿大淋巴结",
                "腋窝_评估分类": None
            },
            "锁骨上侧": {
                "锁骨上_淋巴结表现": None,
                "锁骨上_评估分类": None,
                "锁骨上侧_侧别": None
            },
            "锁骨下侧": {
                "锁骨下_侧别": None,
                "锁骨下_淋巴结表现": None,
                "锁骨下_评估分类": None
            }
        }}

dict2=dic1["output_dict"]
str1 = dic1["text"]

for v in dict2:
    # print(v)
    # print(dict2[v])
    for k in dict2[v]:
        # print(dict2[v][k])
        value = dict2[v][k]
        if value:
            print(value)
            index =str1.find(value)
            offset = [index,index+len(value)]
            print(offset)